---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.HasBoundingBox
source: html/b2bb5304-25d8-b722-445e-f5b054722095.htm
---
# Autodesk.Revit.DB.ElementRecord.HasBoundingBox Method

Determines whether this element record has a bounding box.

## Syntax (C#)
```csharp
public bool HasBoundingBox()
```

## Returns
True if the element record has a bounding box or false otherwise.